___


___
# Seaborn Visualization Exercises

Time to practice your new seaborn skills! Try to recreate the plots below (don't worry about color schemes, just the plot itself.

## The Data

We will be working with a famous titanic data set for these exercises. Later on in the Machine Learning section of the course, we will revisit this data, and use it to predict survival rates of passengers. For now, we'll just focus on the visualization of the data with seaborn:

In [4]:
import seaborn as sns
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
sns.set_style('whitegrid')

In [3]:
titanic = sns.load_dataset('titanic')

In [4]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

# Q.1 Exercises

** Recreate the plots below using the titanic dataframe. There are very few hints since most of the plots can be done with just one or two lines of code and a hint would basically give away the solution. Keep careful attention to the x and y labels for hints.**

## 1.Draw a boxplot and analyze fare in titanic

## 2.Draw a barplot between gender and fare column

## 3.Draw a scatter plot between Age and Fare from Titanic

## 4. Draw a count plot for 'class' variable

##  5.Draw a bar plot of class and fare variables with hue on 'sex' column

#### Q.2  Read ToyotaCorolla file for cars dataset and practice the following questions

In [8]:
cars_data=pd.read_csv('ToyotaCorolla.csv')
cars_data.head()

   Price  Age     KM FuelType  HP  MetColor  Automatic    CC  Doors  Weight
0  13500   23  46986   Diesel  90         1          0  2000      3    1165
1  13750   23  72937   Diesel  90         1          0  2000      3    1165
2  13950   24  41711   Diesel  90         1          0  2000      3    1165
3  14950   26  48000   Diesel  90         0          0  2000      3    1165
4  13750   30  38500   Diesel  90         0          0  2000      3    1170

#### 6. Draw  a  Scatter plot of price vs age

#### 7.Draw a histogram for the x-axis, Age  include kernel density estimate (kde)

#### 8. Draw a  Box plot of the Price column of the dataset to visually interpret the “five-number summary”

####  9. Draw  a pair plot by passing FuelType as a hue and kind='scatter'. Here hue = FuelType because we want to do this pairwise plot by using FuelType on all the rest of the columns.

## Q.3 Exercises based on Iris.csv

In [23]:
iris=pd.read_csv('Iris.csv')
iris.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

#### 10. Draw a scatterplot of the Iris features.kind="scatter", x="Sepal.Length", y="Sepal.Width"

#### 11. Draw   a boxplot with  x="Species", y="Petal.Length"

#### 12. Draw a  pairplot with  Iris-setosa species

# Great Job!

### That is it for now! We'll see a lot more of seaborn practice problems in the machine learning section!